apps/backend/tests/performance/finance/artillery-finance.yml
# Artillery Load Test - Finance Module
# Usage (smoke/default): npx artillery run tests/performance/finance/artillery-finance.yml
# Usage (full):          npx artillery run --environment full tests/performance/finance/artillery-finance.yml

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 5
      arrivalCount: 1
      name: "Smoke"

  environments:
    full:
      phases:
        - duration: 30
          arrivalRate: 2
          name: "Warm up"
        - duration: 60
          arrivalRate: 6
          name: "Ramp up"
        - duration: 90
          arrivalRate: 10
          name: "Peak"

scenarios:
  - name: "Finance Admin Reports & Cash Payment"
    flow:
      # Create an UNPAID booking first (patient)
      - post:
          url: "/api/auth/patient/register"
          json:
            full_name: "Finance Perf Patient"
            email: "perf.finance.patient.{{ $timestamp }}.{{ $randomNumber(1, 1000000) }}@example.com"
            contact_number: "0712345678"
            password: "TestPassword123!"
          capture:
            - json: "$.data.token"
              as: "patientToken"
            - json: "$.data.user.profile._id"
              as: "patientProfileId"
          expect:
            - statusCode: 201

      - post:
          url: "/api/labs"
          json:
            name: "Finance Perf Lab {{ $timestamp }}"
          capture:
            - json: "$._id"
              as: "labId"
          expect:
            - statusCode: 201

      - post:
          url: "/api/test-types"
          json:
            name: "Finance Perf TestType {{ $timestamp }}"
            code: "FT{{ $randomNumber(1000, 9999) }}"
            category: "Other"
            entryMethod: "form"
            discriminatorType: "BloodGlucose"
            description: "Performance test test-type for finance flows."
            reportTemplate: "/templates/perf-finance-test-type"
            isActive: true
          capture:
            - json: "$._id"
              as: "diagnosticTestId"
          expect:
            - statusCode: 201

      - post:
          url: "/api/lab-tests"
          json:
            labId: "{{ labId }}"
            diagnosticTestId: "{{ diagnosticTestId }}"
            price: 1500
            estimatedResultTimeHours: 24
            availabilityStatus: "AVAILABLE"
            dailyCapacity: 50
            isActive: true
          expect:
            - statusCode: [201, 400]

      - post:
          url: "/api/bookings"
          headers:
            Authorization: "Bearer {{ patientToken }}"
          json:
            patientProfileId: "{{ patientProfileId }}"
            healthCenterId: "{{ labId }}"
            diagnosticTestId: "{{ diagnosticTestId }}"
            bookingDate: "2026-04-09T10:00:00.000Z"
            bookingType: "PRE_BOOKED"
            priorityLevel: "NORMAL"
            paymentMethod: "CASH"
          capture:
            - json: "$.booking._id"
              as: "bookingId"
          expect:
            - statusCode: 201

      # Register Admin staff and capture token
      - post:
          url: "/api/auth/staff/register"
          json:
            fullName: "Finance Perf Admin"
            email: "perf.finance.admin.{{ $timestamp }}.{{ $randomNumber(1, 1000000) }}@example.com"
            contactNumber: "0771234567"
            role: "Admin"
            password: "AdminPassword123!"
          capture:
            - json: "$.data.token"
              as: "adminToken"
          expect:
            - statusCode: 201

      # List unpaid bookings & capture first bookingId (should include the one we created)
      - get:
          url: "/api/finance/unpaid-bookings?limit=5"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          capture:
            - json: "$.items[0].bookingId"
              as: "unpaidBookingId"
          expect:
            - statusCode: 200

      # Record a cash payment
      - post:
          url: "/api/finance/payments/cash"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          json:
            bookingId: "{{ unpaidBookingId }}"
            amount: 1500
            notes: "Perf test cash payment"
          expect:
            - statusCode: [201, 400]

      # Reports
      - get:
          url: "/api/finance/summary"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/finance/recent-payments?limit=10"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/finance/payments?limit=50"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200